tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "warrensbox/tap"

# Fonts first
cask "font-caskaydia-cove-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-victor-mono-nerd-font"

brew "awscli"
brew "bat"
brew "cmatrix"
brew "curl"
brew "ctags"
brew "cmake" # Required for tmux plugins
brew "diff-so-fancy"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "gnupg"
brew "gotop"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lazydocker"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "pre-commit"
brew "ripgrep"
brew "starship"
brew "the_silver_searcher"
brew "tlrc"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yq"
brew "zsh"
brew "warrensbox/tap/tfswitch"
brew "volta"

cask "alacritty"
cask "kitty"
