tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "warrensbox/tap"
brew "awscli"
brew "bat"
brew "chezmoi"
brew "cmatrix"
brew "curl"
brew "ctags"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "gnupg", link: false
brew "gotop"
brew "htop"
brew "httpie"
brew "jq"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "pre-commit"
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yq"
brew "zplug"
brew "zsh"
brew "warrensbox/tap/tfswitch"
cask "alacritty"
cask "kitty"
